   // Всё что относиться к задаче 1

'use strict';
let admin;
let name;
name = "Джон";
admin = name;
alert(admin);
   // Всё что относиться к задаче 2

let planetEarth;
let Visitor;

  // Всё что относиться к задаче 3

const BIRTHDAY = '18.04.1982';
/*Тк дата рождения это константа, которая не меняется
после её ввода ни при каких условиях, сколько лет не прошло бы
*/
const age = someCode(birthday);
/*Тут другая ситуация - возраст пересчитывается буквально
каждую секунду, но будем условны, что он будет пересчитываться
каждый год, так что это 'изменяемая' константа
*/